learning_rate : 0.1
n_epochs: 1
dataset: "mnist.pkl.gz"
batch_size: 50
poolsize: 2
conv_layer {
	num_filters: 20
	filter_w: 5
}
conv_layer {
	num_filters: 50
	filter_w: 5
}
hidden_layer {
	num_outputs: 500
	activation_function: "tanh"
}
last_layer {
	num_outputs: 10
	activation_function: "tanh"
}
cost_function: "log_likelihood"
