base_layer {
  kmeans_layer {
    number_of_clusters: 10
  }
  feature_extraction_layer {
  	num_outputs: 10
  }
  pool_layer {
    pool_size: 2
  }  
}

base_layer {
  autoencoders_layer {
    number_of_units: 10
  }
  feature_extraction_layer {
  	num_outputs: 10
  }
  pool_layer {
    pool_size: 2
  }  
}